import pandas as pd

document_text = open('info.csv', 'r')
text_string = document_text.read().lower()
df = pd.read_csv('info.csv', delimiter=';', encoding='1251')
# for i, row in df.iterrows():
#     print(f"Номер в списке: {i}")
#     print('Обучение на направлении', f"{row['Код']}", f"{row['Название']}", 'стоит', f"{row['Цена']}", 'рублей,',
#           'минимальное количество баллов в этом году', f"{row['Мингод']},", 'минимальное количество баллов',
#           f"{row['Мин']},", "общее количество мест", f"{row['МестОбщ']},", "количество бюджетных мест",
#           f"{row['Бюдж']},", "количество целевых мест", f"{row['Целевик']},", "количество квотных мест",
#           f"{row['Квота']},", 'количество платных мест', f"{row['Плат']},", 'чтобы поступить нужно сдавать',
#           f"{row['Экз']}""\n")


a = df[df['Код'] == 350304]
if (len(a) > 1):
    print('Stas')
